# 省份表
PROVINCE2ID = { 
    '北京': 0, '天津': 1, '上海': 2, '重庆': 3, '河北': 4, '山西': 5, '辽宁': 6, '吉林': 7, '黑龙江': 8,
    '江苏': 9, '浙江': 10, '安徽': 11, '福建': 12, '江西': 13, '山东': 14, '河南': 15, '湖北': 16, '湖南': 17,
    '广东': 18, '海南': 19, '四川': 20, '贵州': 21, '云南': 22, '陕西': 23, '甘肃': 24, '青海': 25, '台湾': 26,
    '内蒙古': 27, '广西': 28, '西藏': 29, '宁夏': 30, '新疆': 31, '香港': 32, '澳门': 33, '其他': 34 ,
}
ID2PROVINCE = {v: k for k, v in PROVINCE2ID.items()}


# 心态表
ATTITUDE2ID = {
    # 0-4: 积极
    '高兴': 0,  '搞笑': 1,  '期待': 2,  '肯定': 3,  '感动': 4, 
    # 5-9: 消极 
    '悲伤': 5,  '愤怒': 6,  '厌恶': 7,  '担心': 8,  '无聊': 9, 
    # 10-12: 中性
    '警惕': 10, '惊讶': 11, '无所谓': 12, 
}
ID2ATTITUDE = {v: k for k, v in ATTITUDE2ID.items()}


# 命名体识别表
ENTITY2ID = {
    'None': 0, '时间': 1, '地点': 2, '触发词': 3, '人物': 4, '物品': 5,
    '动作': 6, '事物': 7, '机构': 8, '数量': 9, '单位': 10, '原因': 11, '开/尾': 12,
}
ID2ENTITY = {v: k for k, v in ENTITY2ID.items()}


# 颜色RGB转换表
COLOR = {
    '高兴': {'color': '#FFF2CC', 'rgb': (255, 242, 204)},
	'搞笑': {'color': '#FFE699', 'rgb': (255, 230, 153)},
	'钦佩': {'color': '#FFD966', 'rgb': (255, 217, 102)},
	'肯定': {'color': '#FFBD0B', 'rgb': (255, 189, 11)},
	'感动': {'color': '#F2B100', 'rgb': (242, 177, 0)},
	'悲伤': {'color': '#CBD3EA', 'rgb': (203, 211, 234)},
	'厌恶': {'color': '#9DACD5', 'rgb': (157, 172, 213)},
	'愤怒': {'color': '#6379B5', 'rgb': (99, 121, 181)},
	'担心': {'color': '#2B458F', 'rgb': (43, 69, 143)},
	'无聊': {'color': '#021750', 'rgb': (2, 23, 80)},
	'警惕': {'color': '#E2F0D9', 'rgb': (226, 240, 217)},
	'惊讶': {'color': '#C5E0B4', 'rgb': (197, 224, 180)},
	'无所谓': {'color': '#A9D18E', 'rgb': (169, 209, 142)},
}